In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
a = pd.Series([4,8,15,16,23,42])

In [3]:
a

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
l =[1,2,3,4,5,6,7,8,9,10]

In [5]:
c =pd.Series(l)

In [6]:
c

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3.Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [7]:
d = pd.DataFrame({"Name": ['Alice','Bob',"Clarie"],
                'Age' : [25,30,27],
                'Gender' : ['Female','Male','Female']})

In [8]:
d

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Data Frame: It is the 2 dimensional structured data.
Difference : 
    Dataframe is 2D while Series is 1D.
    Series must be of same type while data frame can be heterogenous.
    Size of a series object, once created, cannot change, while it can be done in a datframe.

In [9]:
# Example:Data Frame

f = pd.DataFrame({"Name": ['Rita','Gita',"Sita"],
                'Age' : [18,19,20],
                'Gender' : ['Female','Female','Female'],
                 'Salary': [100,200,300]})

f

   Name  Age  Gender  Salary
0  Rita   18  Female     100
1  Gita   19  Female     200
2  Sita   20  Female     300

In [10]:
e = pd.Series([1,2,44,45,212])
e

0      1
1      2
2     44
3     45
4    212
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [11]:
df = pd.DataFrame({'Employ_ID': [1111,1112,1113,1114],
                  'Employ_name': ['Rita','Ram','Raju','Roshni'],
                   'Depatment': ['Finance','IT','Sale','Purchase']})

In [12]:
df

   Employ_ID Employ_name Depatment
0       1111        Rita   Finance
1       1112         Ram        IT
2       1113        Raju      Sale
3       1114      Roshni  Purchase

In [13]:
#Creating new column
df['Salary'] = [10000,20000,40000,100000]

In [14]:
#Acessing values of whole column
df['Employ_ID']

0    1111
1    1112
2    1113
3    1114
Name: Employ_ID, dtype: int64

In [15]:
#Applying constraints 
df[df['Employ_ID']>1112]

   Employ_ID Employ_name Depatment  Salary
2       1113        Raju      Sale   40000
3       1114      Roshni  Purchase  100000

In [16]:
#Finding all the columns
df.columns

Index(['Employ_ID', 'Employ_name', 'Depatment', 'Salary'], dtype='object')

In [17]:
#Accessing the values
df['Salary'][0]

10000

In [18]:
#Finding types of each column
df.dtypes

Employ_ID       int64
Employ_name    object
Depatment      object
Salary          int64
dtype: object

In [19]:
#Reassigning the values
df['Salary'][0]=500000

C:\Users\Anjali Shrivastava\AppData\Local\Temp\ipykernel_10676\2484683574.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Salary'][0]=500000

In [20]:
#Deleting a column
df.drop('Employ_ID',axis =1)

  Employ_name Depatment  Salary
0        Rita   Finance  500000
1         Ram        IT   20000
2        Raju      Sale   40000
3      Roshni  Purchase  100000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both data frame and panel are mutable by nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [21]:
Name = ['Alia','Varun','Siddharth','Reshma','Ananya','Tiger']
Name_series = pd.Series(Name)

In [22]:
Class = [10,9,7,8,6,10]
Class_series = pd.Series(Class)

In [23]:
Age = [18,19,17,18,16,18]
Age_series = pd.Series(Age)

In [24]:
pd.DataFrame({'Name': Name_series,'Class': Class_series,'Age':Age_series})

        Name  Class  Age
0       Alia     10   18
1      Varun      9   19
2  Siddharth      7   17
3     Reshma      8   18
4     Ananya      6   16
5      Tiger     10   18